conf t
ip routing
no ip domain-lookup
enable secret xxxx
snmp-server community pubic RO
end
wr

conf t
interface Vlan2
 ip address 192.168.0.1 255.255.255.0
end
wr

conf t
interface GigabitEthernet1/0/24
 description uplink
 no switchport
 ip address 10.10.10.6 255.255.255.252
end
wr

conf t
ip route 0.0.0.0 0.0.0.0 10.10.10.5 
end
wr

conf t
interface range GIgabitEthernet 1/0/1-23
switchport access vlan 2
switchport mode access
end
wr

conf t
line con 0
 logging synchronous
line vty 0 4
 password TELNET암호 
 logging synchronous
line vty 5 15
 logging synchronous
end
wr

<확인>
show clock
show clock detail

<변경>
#conf t
(config)#clock timezone KST 9
(config)#service timestamps log datetime localtime
(config)#exit
#wr

<변경>
clock set 11:12:00 26 June 2013
#wr

<확인>
show clock 
show logging

로그 싱크 : 로그 찍힐때 화면에 나타나는 부분 해결 

#conf t
line con 0
 logging synchronous

#conf t
line vty 0 4
 logging synchronous

<참고-글>
1.1.  L2 스위치 기본설정  - Cisco IOS 기반으로 작성하였다.
 
1.1.1. 장비설정 초기화
Switch# erase startup-config
Switch# reload
 
1.1.2.  Enable passwd 설정
Switch# config t
Switch(config)# enable secret test
Switch(config)# end
Switch# wr (저장)
 
1.1.3.  Telnet 접근제어
Switch(config)#line vty 0 4
Switch(config)#password test
Switch(config-line)# access-class 20 in
Switch(config-line)#exit
Switch(config)#access-list 20 permit 200.1.1.1
 
1.1.4. 레이블링 하기
장비이름 설정
Switch(config)# hostname  test2950
 
포트에 주석달기       
Switch(config)#int f0/1
Switch(config-if)# description  gr.thseo.com
SW11-Main#show  interfaces  des
 
1.1.5. 포트속도와 duplex는 수동으로 설정하라
Switch(config)#int range fa 0/23 - 24
Switch(config-if-range)#speed 100
Switch(config-if-range)#duplex full
Switch(config-if-range)#spanning-tree portfast
Switch(config)#show int status  // 인터페이스 상태 확인
 
1.1.6. 관리용 ip설정
Switch(config)# int VLAN 1
Switch(config-if)# no shut  (필수)
Switch(config-if)# ip address 10.10.10.10 255.255.255.0
Switch(config)#ip default-gateway 10.10.10.254
 
1.1.7. snmp 설정
Switch(config)# snmp-server community inet ro 12
Switch(config)# access-list 12 permit host 203.255.113.37


cisco switch vlan mismatch 로그 남는 부분을 다음과 같이 해결하였습니다.

%CDP-4-NATIVE_VLAN_MISMATCH: Native VLAN mismatch discovered on GigabitEthernet1/0/24 (1), with xxxxxx GigabitEthernet0/45 (10).

#conf t
vtp domain k1sw1
vtp mode transparent

참고로, 
vtp mode transparent만 적용해도 mismatch 로그가 남습니다. 
위와 같이 vtp domain을 명시해줘야 합니다.

